src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФилиала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеВремениСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номеклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
//@skip-check module-region-empty
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Перед записью необходимо заполнить склад.'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Склад", "Объект");		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	НоваяДатаФилиала = ТекущийОбъект.Дата + Объект.СмещениеВремениСклада*3600;
	Если НоваяДатаФилиала <> ТекущийОбъект.ДатаФилиала Тогда
		ТекущийОбъект.ДатаФилиала = НоваяДатаФилиала;
		ТекущийОбъект.Записать();
	КонецЕсли;		
КонецПроцедуры
#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ДатаФилиала = Объект.Дата - Объект.СмещениеВремениСклада*3600;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Объект.СмещениеВремениСклада = гваОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Склад, "ВременноеСмещение");
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	гваОбработкаТабличнойЧастиКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	гваОбработкаТабличнойЧастиКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
КонецПроцедуры
#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиКомандФормы
#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции
#КонецОбласти
